----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Merged/merge_all2.log
  log type:  text
 opened on:  27 Aug 2025, 15:22:47

. drop _all

. use "Stata/NPAs/asset_quality.dta", clear

. merge 1:1 banks quarter_2 using "Stata/Balance Sheet/balance_sheet.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_balance)

. merge 1:1 banks quarter_2 using "Stata/Capital Adequacy/capital_adequacy.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           113
        from master                       113  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,698  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_capad)

. merge 1:1 banks quarter_2 using "Stata/Major Sectoral/major_sectoral.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_sect)

. merge 1:1 banks quarter_2 using "Stata/Profitability/profitability.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_profit)

. merge 1:1 banks quarter_2 using "Stata/Infrastructure/infra.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           267
        from master                       265  (_merge==1)
        from using                          2  (_merge==2)

    Matched                             2,546  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_infra)

. merge 1:1 banks quarter_2 using "Stata/Performance Indicators/perform_ind.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_perform)

. merge 1:1 banks quarter_2 using "Stata/Priority/priority.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_priority)

. save "Stata/Merged/bank_vars_all.dta", replace
file Stata/Merged/bank_vars_all.dta saved

. 
. use "Stata/Merged/bank_vars_all.dta", clear

. 
. drop if banks == "DENA BANK" & quarter_2 == tq(2012q2)
(1 observation deleted)

. fillin banks quarter_2

. 
. *Gen ids for mergers
. gen merger = 1 if (banks == "BHARATIYA MAHILA BANK LTD." | banks == "STATE BANK OF INDIA" //
> /
> | banks == "STATE BANK OF BIKANER AND JAIPUR" | banks == "STATE BANK OF HYDERABAD" ///
> | banks == "STATE BANK OF MYSORE" | banks == "STATE BANK OF PATIALA" ///
> | banks == "STATE BANK OF TRAVANCORE")
(3,162 missing values generated)

. 
. replace merger = 2 if (banks == "ING VYSYA BANK LTD" | banks == "KOTAK MAHINDRA BANK LTD.")
(62 real changes made)

. 
. *Sum up for merged banks
. local varlist gross_advances gross_npas substandard_advances doubtful_advances ///
> loss_advances provision_npas provision_coverage net_advances net_npas ///
> restruct_stand_advances stressed_adv loans_to_ARCs loss_gain cashfunds ///
> due_from_banks slr_securities nslr_inv net_loans_advances net_fixed_assets ///
> other_assets total_assets paidup_share_capital reserves_surplus total_deposits ///
> customer_deposits current_deposits savings_deposits time_deposits nri_deposits ///
> certificate_deposits deposits_banks deposits_ind_banks deposits_nind_banks ///
> total_borrowings other_liabilities total_liabilities tier_1 tier_1_comm tier_2 ///
> total_cap gross_adv gnpa food_cred_gadv food_cred_gnpa nfc_gadv nfc_gnp ///
> agri_gadv agri_gnpa ind_gadv ind_gnpa serv_gadv serv_gnpa retail_gadv retail_gnpa ///
> onfc_gadv onfc_gnpa house_gadv house_gnpa auto_gadv auto_gnpa cred_gadv cred_gnpa ///
> edu_gadv edu_gnpa oretail_gadv oretail_gnpa total_int_inc int_exp NII OOI ///
> total_oi OE staff_exp net_oi capital_gains other_noi EBPT risk_prov write_offs ///
> liability_ptov PBT IT_prov PAT infrastructure transport railways urban_pub_transport ///
> shipyards logistics_infra logistic_govt_psu energy elec_gen elec_govt_psu ///
> state_elec_board elec_transmission elec_distr_govt_psu elec_distr_state elec_distr ///
> oil oil_storage oil_others solid_waste water_sanitation water_treatment ///
> water_sanitation_2 irrigation strom_water slurry_pipe communication telecom_twr ///
> soc_comm_infra edu_infra hospital tourism other_soc_comm fertilizer harv_storage ///
> terminal_mkt soil_testing cost_funds yield_funds priority_gadv priority_gnpa ///
> non_priority_gadv non_priority_gnpa mse_gadv mse_gnpa other_priority_gadv other_priority_gnp
> a

. 
. foreach var in `varlist' {
  2.     local new_varname : subinstr local var " " "_", all
  3.     bysort quarter_2: egen `new_varname'_sum = total(`var') if merger == 1
  4. }
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)

. 
. foreach var in `varlist' {
  2.         replace `var' = `var'_sum if banks == "STATE BANK OF INDIA"
  3. }
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(27 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(12 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(17 real changes made)
(5 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(21 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(23 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(28 real changes made)
(29 real changes made)
(31 real changes made)
(22 real changes made)
(30 real changes made)
(31 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(31 real changes made)
(29 real changes made)
(29 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(20 real changes made)
(20 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)

. 
. foreach var in `varlist' {
  2.         drop `var'_sum
  3. }

. 
. foreach var in `varlist' {
  2.     local new_varname : subinstr local var " " "_", all
  3.     bysort quarter_2: egen `new_varname'_sum = total(`var') if merger == 2
  4. }
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)

. 
. foreach var in `varlist' {
  2.         replace `var' = `var'_sum if banks == "KOTAK MAHINDRA BANK LTD."
  3. }
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(11 real changes made)
(31 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(31 real changes made)
(27 real changes made)
(27 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(26 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(12 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(24 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(31 real changes made)
(28 real changes made)
(30 real changes made)
(25 real changes made)
(31 real changes made)
(19 real changes made)
(21 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(17 real changes made)
(31 real changes made)
(31 real changes made)
(28 real changes made)
(16 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(16 real changes made)
(5 real changes made)
(16 real changes made)
(25 real changes made)
(25 real changes made)
(15 real changes made)
(22 real changes made)
(24 real changes made)
(21 real changes made)
(24 real changes made)
(13 real changes made)
(15 real changes made)
(15 real changes made)
(17 real changes made)
(4 real changes made)
(4 real changes made)
(14 real changes made)
(15 real changes made)
(28 real changes made)
(20 real changes made)
(27 real changes made)
(18 real changes made)
(14 real changes made)
(14 real changes made)
(27 real changes made)
(27 real changes made)
(22 real changes made)
(21 real changes made)
(15 real changes made)
(14 real changes made)
(12 real changes made)
(17 real changes made)
(20 real changes made)
(13 real changes made)
(13 real changes made)
(13 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(28 real changes made)

. 
. foreach var in `varlist' {
  2.         drop `var'_sum
  3. }

. 
. 
. drop if (banks == "BHARATIYA MAHILA BANK LTD." | banks == "ING VYSYA BANK LTD" ///
> |banks == "STATE BANK OF BIKANER AND JAIPUR" |banks == "STATE BANK OF HYDERABAD" ///
> |banks == "STATE BANK OF MYSORE" |banks == "STATE BANK OF PATIALA" ///
> |banks == "STATE BANK OF TRAVANCORE")
(217 observations deleted)

. 
. egen bank_num = group(banks)

. xtset bank_num quarter_2

Panel variable: bank_num (strongly balanced)
 Time variable: quarter_2, 2012q2 to 2019q4
         Delta: 1 quarter

. spbalance 
  (data strongly balanced)

. gen type_bank = 1 if foreign_dummy == 1
(1,843 missing values generated)

. replace type_bank = 2 if private_dummy == 1
(621 real changes made)

. replace type_bank = 3 if public_dummy == 1
(644 real changes made)

. replace type_bank = 4 if small_finance_dummy == 1
(103 real changes made)

. sort banks quarter_2

. save "Stata/Merged/bank_vars_all.dta", replace
file Stata/Merged/bank_vars_all.dta saved

. 
. use "Stata/Merged/bank_vars_all.dta", clear

. 
. browse if type_bank ==.

. 
. replace foreign_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace private_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace public_dummy = 1 if banks == "DENA BANK"
(4 real changes made)

. replace small_finance_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace type_bank = 3 if banks == "DENA BANK"
(4 real changes made)

. 
. replace foreign_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace private_dummy = 1 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace public_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace small_finance_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace type_bank = 2 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. 
. replace foreign_dummy = 1 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace private_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace public_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace small_finance_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace type_bank = 1 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. 
. replace foreign_dummy = 1 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace private_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace public_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace small_finance_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace type_bank = 1 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. 
. replace foreign_dummy = 1 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace private_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace public_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace type_bank = 1 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. 
. replace foreign_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace private_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace public_dummy = 1 if banks == "VIJAYA BANK"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace type_bank = 3 if banks == "VIJAYA BANK"
(3 real changes made)

. 
. replace foreign_dummy = 1 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace private_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace public_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace type_bank = 1 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. 
. gen gnpa_ratio = gross_npas/total_assets * 100
(477 missing values generated)

. 
. *Fixing Sectors
. replace food_cred_gnpa =. if food_cred_gadv ==. 
(812 real changes made, 812 to missing)

. replace nfc_gnp =. if nfc_gadv ==.
(16 real changes made, 16 to missing)

. replace agri_gnpa =. if agri_gadv ==. 
(520 real changes made, 520 to missing)

. replace ind_gnpa =. if ind_gadv ==. 
(82 real changes made, 82 to missing)

. replace serv_gnpa =. if serv_gadv ==. 
(185 real changes made, 185 to missing)

. replace retail_gnpa =. if retail_gadv ==. 
(407 real changes made, 407 to missing)

. replace onfc_gnpa =. if onfc_gadv ==. 
(77 real changes made, 77 to missing)

. replace house_gnpa =. if house_gadv ==. 
(495 real changes made, 495 to missing)

. replace auto_gnpa =. if auto_gadv ==. 
(623 real changes made, 623 to missing)

. replace cred_gnpa =. if cred_gadv ==. 
(745 real changes made, 745 to missing)

. replace edu_gnpa =. if edu_gadv ==. 
(650 real changes made, 650 to missing)

. replace oretail_gnpa =. if oretail_gadv ==. 
(407 real changes made, 407 to missing)

. 
. *Fixing Priority
. replace priority_gnpa =. if priority_gadv ==.
(69 real changes made, 69 to missing)

. replace non_priority_gnpa =. if non_priority_gadv ==.
(31 real changes made, 31 to missing)

. replace mse_gnpa =. if mse_gadv ==.
(299 real changes made, 299 to missing)

. replace other_priority_gnpa =. if other_priority_gadv ==.
(69 real changes made, 69 to missing)

. 
. *Sector1
. gen fc_dummy = 1 if food_cred_gadv > nfc_gadv
(1,676 missing values generated)

. replace fc_dummy = 0 if fc_dummy ==.
(1,676 real changes made)

. 
. gen agri_dummy = 1 if agri_gadv > ind_gadv & agri_gadv > serv_gadv & ///
> agri_gadv > retail_gadv & agri_gadv > onfc_gadv
(3,105 missing values generated)

. replace agri_dummy = 0 if agri_dummy ==.
(3,105 real changes made)

. 
. gen ind_dummy = 1 if ind_gadv > agri_gadv & ind_gadv > serv_gadv & ///
> ind_gadv > retail_gadv & ind_gadv > onfc_gadv
(2,779 missing values generated)

. replace ind_dummy = 0 if ind_dummy ==.
(2,779 real changes made)

. 
. gen serv_dummy = 1 if serv_gadv > agri_gadv & serv_gadv > ind_gadv & ///
> serv_gadv > retail_gadv & serv_gadv > onfc_gadv
(2,936 missing values generated)

. replace serv_dummy = 0 if serv_dummy ==.
(2,936 real changes made)

. 
. gen retail_dummy = 1 if retail_gadv > agri_gadv & retail_gadv > ind_gadv & ///
> retail_gadv > serv_gadv & retail_gadv > onfc_gadv
(3,092 missing values generated)

. replace retail_dummy = 0 if retail_dummy ==.
(3,092 real changes made)

. 
. gen onfc_dummy = 1 if onfc_gadv > agri_gadv & onfc_gadv > ind_gadv & ///
> onfc_gadv > serv_gadv & onfc_gadv > retail_gadv
(2,623 missing values generated)

. replace onfc_dummy = 0 if onfc_dummy ==.
(2,623 real changes made)

. 
. *Priority1
. gen npri_dummy = 1 if non_priority_gadv > priority_gadv
(868 missing values generated)

. replace npri_dummy = 0 if npri_dummy ==.
(868 real changes made)

. 
. gen mse_dummy = 1 if mse_gadv > other_priority_gadv
(1,543 missing values generated)

. replace mse_dummy = 0 if mse_dummy ==.
(1,543 real changes made)

. 
. gen opri_dummy = 1 if other_priority_gadv > mse_gadv
(2,270 missing values generated)

. replace opri_dummy = 0 if opri_dummy ==.
(2,270 real changes made)

. 
. *Infrastructure1
. gen trans_dummy = 1 if transport > energy & transport > water_sanitation & ///
> transport > communication & transport > soc_comm_infra
(3,113 missing values generated)

. replace trans_dummy = 0 if trans_dummy ==.
(3,113 real changes made)

. 
. gen energy_dummy = 1 if energy > transport & energy > water_sanitation & ///
> energy > communication & energy > soc_comm_infra
(2,811 missing values generated)

. replace energy_dummy = 0 if energy_dummy ==.
(2,811 real changes made)

. 
. gen water_dummy = 1 if water_sanitation > transport & water_sanitation > energy & ///
> water_sanitation > communication & water_sanitation > soc_comm_infra
(3,125 missing values generated)

. replace water_dummy = 0 if water_dummy ==.
(3,125 real changes made)

. 
. gen comm_dummy = 1 if communication > transport & communication > energy & ///
> communication > water_sanitation & communication > soc_comm_infra
(2,063 missing values generated)

. replace comm_dummy = 0 if comm_dummy ==.
(2,063 real changes made)

. 
. gen soc_comm_dummy = 1 if soc_comm_infra > transport & soc_comm_infra > energy & ///
> soc_comm_infra > water_sanitation & soc_comm_infra > communication
(3,099 missing values generated)

. replace soc_comm_dummy = 0 if soc_comm_dummy ==.
(3,099 real changes made)

. 
. *Sector2
. egen sum_sec_gadv = rowtotal(food_cred_gadv agri_gadv ind_gadv serv_gadv retail_gadv onfc_ga
> dv)

. replace sum_sec_gadv =. if sum_sec_gadv == 0
(704 real changes made, 704 to missing)

. 
. gen food_ratio = food_cred_gadv/sum_sec_gadv
(2,168 missing values generated)

. gen agri_ratio = agri_gadv/sum_sec_gadv
(1,876 missing values generated)

. gen ind_ratio = ind_gadv/sum_sec_gadv
(1,440 missing values generated)

. gen serv_ratio = serv_gadv/sum_sec_gadv
(997 missing values generated)

. gen retail_ratio = retail_gadv/sum_sec_gadv
(1,093 missing values generated)

. gen onfc_ratio = onfc_gadv/sum_sec_gadv
(2,340 missing values generated)

. 
. bysort quarter_2: egen food_ratio_med = median(food_ratio)

. bysort quarter_2: egen agri_ratio_med = median(agri_ratio)

. bysort quarter_2: egen ind_ratio_med = median(ind_ratio)

. bysort quarter_2: egen serv_ratio_med = median(serv_ratio)

. bysort quarter_2: egen retail_ratio_med = median(retail_ratio)

. bysort quarter_2: egen onfc_ratio_med = median(onfc_ratio)

. 
. gen fc_dummy2 = 1 if food_ratio >= food_ratio_med
(482 missing values generated)

. replace fc_dummy2 = 0 if food_ratio < food_ratio_med
(482 real changes made)

. // replace fc_dummy2 = 0 if food_ratio ==.
. replace fc_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. gen agri_dummy2 = 1 if agri_ratio >= agri_ratio_med
(627 missing values generated)

. replace agri_dummy2 = 0 if agri_ratio < agri_ratio_med
(627 real changes made)

. // replace agri_dummy2 = 0 if agri_ratio ==.
. replace agri_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. gen ind_dummy2 = 1 if ind_ratio >= ind_ratio_med
(845 missing values generated)

. replace ind_dummy2 = 0 if ind_ratio < ind_ratio_med
(845 real changes made)

. // replace ind_dummy2 = 0 if ind_ratio ==.
. replace ind_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. gen serv_dummy2 = 1 if serv_ratio >= serv_ratio_med
(917 missing values generated)

. replace serv_dummy2 = 0 if serv_ratio < serv_ratio_med
(917 real changes made)

. // replace serv_dummy2 = 0 if serv_ratio ==.
. replace serv_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. gen retail_dummy2 = 1 if retail_ratio >= retail_ratio_med
(989 missing values generated)

. replace retail_dummy2 = 0 if retail_ratio < retail_ratio_med
(989 real changes made)

. // replace retail_dummy2 = 0 if retail_ratio ==.
. replace retail_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. gen onfc_dummy2 = 1 if onfc_ratio >= onfc_ratio_med
(394 missing values generated)

. replace onfc_dummy2 = 0 if onfc_ratio < onfc_ratio_med
(394 real changes made)

. // replace onfc_dummy2 = 0 if onfc_ratio ==.
. replace onfc_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(859 real changes made, 859 to missing)

. 
. 
. *Priority2
. egen sum_pri_gadv = rowtotal(non_priority_gadv mse_gadv other_priority_gadv)

. replace sum_pri_gadv =. if sum_pri_gadv == 0
(521 real changes made, 521 to missing)

. 
. gen npri_ratio = non_priority_gadv/sum_pri_gadv
(537 missing values generated)

. gen mse_ratio = mse_gadv/sum_pri_gadv
(801 missing values generated)

. gen opri_ratio = other_priority_gadv/sum_pri_gadv
(572 missing values generated)

. 
. bysort quarter_2: egen npri_ratio_med = median(npri_ratio)

. bysort quarter_2: egen mse_ratio_med = median(mse_ratio)

. bysort quarter_2: egen opri_ratio_med = median(opri_ratio)

. 
. gen npri_dummy2 = 1 if npri_ratio >= npri_ratio_med
(1,302 missing values generated)

. replace npri_dummy2 = 0 if npri_ratio < npri_ratio_med
(1,302 real changes made)

. replace npri_dummy2 = 0 if npri_ratio ==.
(537 real changes made)

. replace npri_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(521 real changes made, 521 to missing)

. 
. gen mse_dummy2 = 1 if mse_ratio >= mse_ratio_med
(1,171 missing values generated)

. replace mse_dummy2 = 0 if mse_ratio < mse_ratio_med
(1,171 real changes made)

. replace mse_dummy2 = 0 if mse_ratio ==.
(801 real changes made)

. replace mse_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(521 real changes made, 521 to missing)

. 
. gen opri_dummy2 = 1 if opri_ratio >= opri_ratio_med
(1,288 missing values generated)

. replace opri_dummy2 = 0 if opri_ratio < opri_ratio_med
(1,288 real changes made)

. replace opri_dummy2 = 0 if opri_ratio ==.
(572 real changes made)

. replace opri_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(521 real changes made, 521 to missing)

. 
. *Infrastructure2
. egen sum_infra_gadv = rowtotal(transport energy water_sanitation communication soc_comm_infr
> a)

. replace sum_infra_gadv =. if sum_infra_gadv == 0
(1,518 real changes made, 1,518 to missing)

. 
. bysort quarter_2: gen trans_ratio = transport/sum_infra_gadv
(1,698 missing values generated)

. bysort quarter_2: gen energy_ratio = energy/sum_infra_gadv
(1,627 missing values generated)

. bysort quarter_2: gen water_san_ratio = water_sanitation/sum_infra_gadv
(1,770 missing values generated)

. bysort quarter_2: gen comm_ratio = communication/sum_infra_gadv
(2,486 missing values generated)

. bysort quarter_2: gen soc_comm_ratio = soc_comm_infra/sum_infra_gadv
(1,719 missing values generated)

. 
. egen trans_ratio_med = median(trans_ratio)

. egen energy_ratio_med = median(energy_ratio)

. egen water_san_ratio_med = median(water_san_ratio)

. egen comm_ratio_med = median(comm_ratio)

. egen soc_comm_ratio_med = median(soc_comm_ratio)

. 
. gen trans_dummy2 = 1 if trans_ratio >= trans_ratio_med
(732 missing values generated)

. replace trans_dummy2 = 0 if trans_ratio < trans_ratio_med
(732 real changes made)

. // replace trans_dummy2 = 0 if trans_ratio ==.
. replace trans_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_ratio ==.
(1,518 real changes made, 1,518 to missing)

. 
. gen energy_dummy2 = 1 if energy_ratio >= energy_ratio_med
(767 missing values generated)

. replace energy_dummy2 = 0 if energy_ratio < energy_ratio_med
(767 real changes made)

. // replace energy_dummy2 = 0 if energy_ratio ==.
. replace energy_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_ratio ==.
(1,518 real changes made, 1,518 to missing)

. 
. gen water_dummy2 = 1 if water_san_ratio >= water_san_ratio_med
(696 missing values generated)

. replace water_dummy2 = 0 if water_san_ratio < water_san_ratio_med
(696 real changes made)

. // replace water_dummy2 = 0 if water_san_ratio ==.
. replace water_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_ratio ==.
(1,518 real changes made, 1,518 to missing)

. 
. gen comm_dummy2 = 1 if comm_ratio >= comm_ratio_med

. replace comm_dummy2 = 0 if comm_ratio < comm_ratio_med
(0 real changes made)

. // replace comm_dummy2 = 0 if comm_ratio ==.
. replace comm_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_ratio ==.
(1,518 real changes made, 1,518 to missing)

. 
. gen soc_comm_dummy2 = 1 if soc_comm_ratio >= soc_comm_ratio_med
(721 missing values generated)

. replace soc_comm_dummy2 = 0 if soc_comm_ratio < soc_comm_ratio_med
(721 real changes made)

. // replace soc_comm_dummy2 = 0 if soc_comm_ratio ==.
. replace soc_comm_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_ratio ==.
(1,518 real changes made, 1,518 to missing)

. 
. *Region
. merge m:1 banks using "Stata/Branches/state_dummies.dta"
(variable banks was str47, now str57 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,190
        from master                     1,178  (_merge==1)
        from using                         12  (_merge==2)

    Matched                             1,984  (_merge==3)
    -----------------------------------------

. drop if _merge == 2
(12 observations deleted)

. sort banks quarter_2

. 
. save "Stata/Merged/bank_vars_all.dta", replace
file Stata/Merged/bank_vars_all.dta saved

. 
. use "Stata/Merged/bank_vars_all.dta", clear

. browse if type_bank ==.

. keep if quarter_2 == tq(2016q4)
(3,060 observations deleted)

. count if type_bank == 1 
  43

. *50 foreign banks
. count if type_bank == 2
  21

. *21 private banks
. count if type_bank == 3
  21

. *21 public banks
. count if type_bank == 4
  2

. *10 small finance banks
. 
. log close
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Merged/merge_all2.log
  log type:  text
 closed on:  27 Aug 2025, 15:22:48
----------------------------------------------------------------------------------------------
