----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Merged/merge_all.log
  log type:  text
 opened on:  27 Aug 2025, 14:58:13

. drop _all

. use "Stata/NPAs/asset_quality.dta", clear

. merge 1:1 banks quarter_2 using "Stata/Balance Sheet/balance_sheet.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_balance)

. merge 1:1 banks quarter_2 using "Stata/Capital Adequacy/capital_adequacy.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           113
        from master                       113  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,698  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_capad)

. merge 1:1 banks quarter_2 using "Stata/Major Sectoral/major_sectoral.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_sect)

. merge 1:1 banks quarter_2 using "Stata/Profitability/profitability.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_profit)

. merge 1:1 banks quarter_2 using "Stata/Infrastructure/infra.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           267
        from master                       265  (_merge==1)
        from using                          2  (_merge==2)

    Matched                             2,546  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_infra)

. merge 1:1 banks quarter_2 using "Stata/Performance Indicators/perform_ind.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_perform)

. merge 1:1 banks quarter_2 using "Stata/Priority/priority.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             2,811  (_merge==3)
    -----------------------------------------

. rename(_merge)(merge_priority)

. save "Stata/Merged/bank_vars.dta", replace
(file Stata/Merged/bank_vars.dta not found)
file Stata/Merged/bank_vars.dta saved

. *browse if merge_capad == 1
. *browse if merge_infra == 1
. *browse if merge_perform == 1
. use "Stata/Merged/bank_vars.dta", clear

. fillin banks quarter_2

. drop if quarter_2 < tq(2014q1)
(763 observations deleted)

. drop if quarter_2 > tq(2018q3)
(545 observations deleted)

. keep banks quarter_2 gross_advances gross_npas total_assets total_deposits ///
> total_liabilities _fillin

. browse if gross_npas ==. | gross_advances == . | total_assets == . | ///
> total_deposits ==. | total_liabilities ==.

. *KOTAK MAHINDRA BANK LTD. only has one missing at 2015q3
. browse if gross_advances == 0

. *NATIONAL AUSTRALIA BANK has gorss_adv at 0 for 2014q3 & q4, Natwest has 0 for 2018q2 & q3
. use "Stata/Merged/bank_vars.dta", clear

. *DENA BANK 2012q2 gnpa ratio is 71k, definitely wrong
. drop if banks == "DENA BANK" & quarter_2 == tq(2012q2)
(1 observation deleted)

. fillin banks quarter_2

. *Gen ids for mergers
. gen merger = 1 if (banks == "BHARATIYA MAHILA BANK LTD." | banks == "STATE BANK OF INDIA" //
> /
> | banks == "STATE BANK OF BIKANER AND JAIPUR" | banks == "STATE BANK OF HYDERABAD" ///
> | banks == "STATE BANK OF MYSORE" | banks == "STATE BANK OF PATIALA" ///
> | banks == "STATE BANK OF TRAVANCORE")
(3,162 missing values generated)

. 
. replace merger = 2 if (banks == "ING VYSYA BANK LTD" | banks == "KOTAK MAHINDRA BANK LTD.")
(62 real changes made)

. 
. *Sum up for merged banks
. local varlist gross_advances gross_npas substandard_advances doubtful_advances ///
> loss_advances provision_npas provision_coverage net_advances net_npas ///
> restruct_stand_advances stressed_adv loans_to_ARCs loss_gain cashfunds ///
> due_from_banks slr_securities nslr_inv net_loans_advances net_fixed_assets ///
> other_assets total_assets paidup_share_capital reserves_surplus total_deposits ///
> customer_deposits current_deposits savings_deposits time_deposits nri_deposits ///
> certificate_deposits deposits_banks deposits_ind_banks deposits_nind_banks ///
> total_borrowings other_liabilities total_liabilities tier_1 tier_1_comm tier_2 ///
> total_cap gross_adv gnpa food_cred_gadv food_cred_gnpa nfc_gadv nfc_gnp ///
> agri_gadv agri_gnpa ind_gadv ind_gnpa serv_gadv serv_gnpa retail_gadv retail_gnpa ///
> onfc_gadv onfc_gnpa house_gadv house_gnpa auto_gadv auto_gnpa cred_gadv cred_gnpa ///
> edu_gadv edu_gnpa oretail_gadv oretail_gnpa total_int_inc int_exp NII OOI ///
> total_oi OE staff_exp net_oi capital_gains other_noi EBPT risk_prov write_offs ///
> liability_ptov PBT IT_prov PAT infrastructure transport railways urban_pub_transport ///
> shipyards logistics_infra logistic_govt_psu energy elec_gen elec_govt_psu ///
> state_elec_board elec_transmission elec_distr_govt_psu elec_distr_state elec_distr ///
> oil oil_storage oil_others solid_waste water_sanitation water_treatment ///
> water_sanitation_2 irrigation strom_water slurry_pipe communication telecom_twr ///
> soc_comm_infra edu_infra hospital tourism other_soc_comm fertilizer harv_storage ///
> terminal_mkt soil_testing cost_funds yield_funds priority_gadv priority_gnpa ///
> non_priority_gadv non_priority_gnpa mse_gadv mse_gnpa other_priority_gadv other_priority_gnp
> a

. 
. foreach var in `varlist' {
  2.     local new_varname : subinstr local var " " "_", all
  3.     bysort quarter_2: egen `new_varname'_sum = total(`var') if merger == 1
  4. }
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)
(3,162 missing values generated)

. 
. foreach var in `varlist' {
  2.         replace `var' = `var'_sum if banks == "STATE BANK OF INDIA"
  3. }
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(27 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(12 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(17 real changes made)
(5 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(21 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(23 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(28 real changes made)
(29 real changes made)
(31 real changes made)
(22 real changes made)
(30 real changes made)
(31 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(31 real changes made)
(29 real changes made)
(29 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(30 real changes made)
(20 real changes made)
(20 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)

. 
. foreach var in `varlist' {
  2.         drop `var'_sum
  3. }

. 
. foreach var in `varlist' {
  2.     local new_varname : subinstr local var " " "_", all
  3.     bysort quarter_2: egen `new_varname'_sum = total(`var') if merger == 2
  4. }
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)
(3,317 missing values generated)

. 
. foreach var in `varlist' {
  2.         replace `var' = `var'_sum if banks == "KOTAK MAHINDRA BANK LTD."
  3. }
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(11 real changes made)
(31 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(31 real changes made)
(27 real changes made)
(27 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(31 real changes made)
(26 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(12 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(24 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(31 real changes made)
(28 real changes made)
(30 real changes made)
(25 real changes made)
(31 real changes made)
(19 real changes made)
(21 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(20 real changes made)
(17 real changes made)
(31 real changes made)
(31 real changes made)
(28 real changes made)
(16 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(27 real changes made)
(16 real changes made)
(5 real changes made)
(16 real changes made)
(25 real changes made)
(25 real changes made)
(15 real changes made)
(22 real changes made)
(24 real changes made)
(21 real changes made)
(24 real changes made)
(13 real changes made)
(15 real changes made)
(15 real changes made)
(17 real changes made)
(4 real changes made)
(4 real changes made)
(14 real changes made)
(15 real changes made)
(28 real changes made)
(20 real changes made)
(27 real changes made)
(18 real changes made)
(14 real changes made)
(14 real changes made)
(27 real changes made)
(27 real changes made)
(22 real changes made)
(21 real changes made)
(15 real changes made)
(14 real changes made)
(12 real changes made)
(17 real changes made)
(20 real changes made)
(13 real changes made)
(13 real changes made)
(13 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(28 real changes made)

. 
. foreach var in `varlist' {
  2.         drop `var'_sum
  3. }

. 
. 
. drop if (banks == "AU SMALL FINANCE BANK LIMITED" |banks == "BANDHAN BANK LIMITED" ///
> |banks == "BANK OF CHINA LIMITED" |banks == "BHARATIYA MAHILA BANK LTD." ///
> |banks == "CAPITAL SMALL FINANCE BANK LIMITED" |banks == "COMMONWEALTH BANK OF AUSTRALIA" //
> /
> |banks == "DOHA BANK Q.P.S.C" |banks == "EMIRATES NBD BANK (P.J.S.C.)" ///
> |banks == "EQUITAS SMALL FINANCE BANK LIMITED" |banks == "ESAF SMALL FINANCE BANK LIMITED" /
> //
> |banks == "FINCARE SMALL FINANCE BANK LIMITED" |banks == "FIRST ABU DHABI BANK PJSC" ///
> |banks == "HSBC BANK OMAN S.A.O.G." |banks == "IDFC FIRST BANK LIMITED" ///
> |banks == "INDUSTRIAL BANK OF KOREA" |banks == "ING VYSYA BANK LTD" ///
> |banks == "JANA SMALL FINANCE BANK LIMITED" |banks == "KBC BANK NV" ///
> |banks == "KEB HANA BANK" |banks == "KOOKMIN BANK" ///
> |banks == "NORTH EAST SMALL FINANCE BANK LIMITED" |banks == "Qatar National Bank (Q.P.S.C.)"
>  ///
> |banks == "STATE BANK OF BIKANER AND JAIPUR" |banks == "STATE BANK OF HYDERABAD" ///
> |banks == "STATE BANK OF MYSORE" |banks == "STATE BANK OF PATIALA" ///
> |banks == "STATE BANK OF TRAVANCORE" |banks == "SURYODAY SMALL FINANCE BANK LIMITED" ///
> |banks == "UBS AG" |banks == "UJJIVAN SMALL FINANCE BANK LIMITED" ///
> |banks == "UTKARSH SMALL FINANCE BANK LIMITED")
(961 observations deleted)

. 
. egen bank_num = group(banks)

. xtset bank_num quarter_2

Panel variable: bank_num (strongly balanced)
 Time variable: quarter_2, 2012q2 to 2019q4
         Delta: 1 quarter

. spbalance 
  (data strongly balanced)

. gen type_bank = 1 if foreign_dummy == 1
(1,253 missing values generated)

. replace type_bank = 2 if private_dummy == 1
(588 real changes made)

. replace type_bank = 3 if public_dummy == 1
(644 real changes made)

. replace type_bank = 4 if small_finance_dummy == 1
(0 real changes made)

. save "Stata/Merged/bank_vars.dta", replace
file Stata/Merged/bank_vars.dta saved

. 
. use "Stata/Merged/bank_vars.dta", clear

. 
. browse if type_bank ==.

. 
. replace foreign_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace private_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace public_dummy = 1 if banks == "DENA BANK"
(4 real changes made)

. replace small_finance_dummy = 0 if banks == "DENA BANK"
(4 real changes made)

. replace type_bank = 3 if banks == "DENA BANK"
(4 real changes made)

. 
. replace foreign_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace private_dummy = 1 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace public_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace small_finance_dummy = 0 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. replace type_bank = 2 if banks == "KOTAK MAHINDRA BANK LTD."
(1 real change made)

. 
. replace foreign_dummy = 1 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace private_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace public_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace small_finance_dummy = 0 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. replace type_bank = 1 if banks == "NATIONAL AUSTRALIA BANK"
(2 real changes made)

. 
. replace foreign_dummy = 1 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace private_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace public_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace small_finance_dummy = 0 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. replace type_bank = 1 if banks == "PT BANK MAYBANK INDONESIA TBK"
(5 real changes made)

. 
. replace foreign_dummy = 1 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace private_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace public_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. replace type_bank = 1 if banks == "SUMITOMO MITSUI BANKING CORPORATION"
(3 real changes made)

. 
. replace foreign_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace private_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace public_dummy = 1 if banks == "VIJAYA BANK"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "VIJAYA BANK"
(3 real changes made)

. replace type_bank = 3 if banks == "VIJAYA BANK"
(3 real changes made)

. 
. replace foreign_dummy = 1 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace private_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace public_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace small_finance_dummy = 0 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. replace type_bank = 1 if banks == "WESTPAC BANKING CORPORATION"
(3 real changes made)

. 
. gen gnpa_ratio = gross_npas/total_assets * 100
(22 missing values generated)

. 
. *Fixing Sectors
. replace food_cred_gnpa =. if food_cred_gadv ==. 
(611 real changes made, 611 to missing)

. replace nfc_gnp =. if nfc_gadv ==.
(1 real change made, 1 to missing)

. replace agri_gnpa =. if agri_gadv ==. 
(426 real changes made, 426 to missing)

. replace ind_gnpa =. if ind_gadv ==. 
(41 real changes made, 41 to missing)

. replace serv_gnpa =. if serv_gadv ==. 
(131 real changes made, 131 to missing)

. replace retail_gnpa =. if retail_gadv ==. 
(328 real changes made, 328 to missing)

. replace onfc_gnpa =. if onfc_gadv ==. 
(71 real changes made, 71 to missing)

. replace house_gnpa =. if house_gadv ==. 
(403 real changes made, 403 to missing)

. replace auto_gnpa =. if auto_gadv ==. 
(469 real changes made, 469 to missing)

. replace cred_gnpa =. if cred_gadv ==. 
(559 real changes made, 559 to missing)

. replace edu_gnpa =. if edu_gadv ==. 
(494 real changes made, 494 to missing)

. replace oretail_gnpa =. if oretail_gadv ==. 
(328 real changes made, 328 to missing)

. 
. *Fixing Priority
. replace priority_gnpa =. if priority_gadv ==.
(37 real changes made, 37 to missing)

. replace non_priority_gnpa =. if non_priority_gadv ==.
(9 real changes made, 9 to missing)

. replace mse_gnpa =. if mse_gadv ==.
(243 real changes made, 243 to missing)

. replace other_priority_gnpa =. if other_priority_gadv ==.
(37 real changes made, 37 to missing)

. 
. *Sector1
. gen fc_dummy = 1 if food_cred_gadv > nfc_gadv
(1,150 missing values generated)

. replace fc_dummy = 0 if fc_dummy ==.
(1,150 real changes made)

. 
. gen agri_dummy = 1 if agri_gadv > ind_gadv & agri_gadv > serv_gadv & ///
> agri_gadv > retail_gadv & agri_gadv > onfc_gadv
(2,387 missing values generated)

. replace agri_dummy = 0 if agri_dummy ==.
(2,387 real changes made)

. 
. gen ind_dummy = 1 if ind_gadv > agri_gadv & ind_gadv > serv_gadv & ///
> ind_gadv > retail_gadv & ind_gadv > onfc_gadv
(2,037 missing values generated)

. replace ind_dummy = 0 if ind_dummy ==.
(2,037 real changes made)

. 
. gen serv_dummy = 1 if serv_gadv > agri_gadv & serv_gadv > ind_gadv & ///
> serv_gadv > retail_gadv & serv_gadv > onfc_gadv
(2,211 missing values generated)

. replace serv_dummy = 0 if serv_dummy ==.
(2,211 real changes made)

. 
. gen retail_dummy = 1 if retail_gadv > agri_gadv & retail_gadv > ind_gadv & ///
> retail_gadv > serv_gadv & retail_gadv > onfc_gadv
(2,357 missing values generated)

. replace retail_dummy = 0 if retail_dummy ==.
(2,357 real changes made)

. 
. gen onfc_dummy = 1 if onfc_gadv > agri_gadv & onfc_gadv > ind_gadv & ///
> onfc_gadv > serv_gadv & onfc_gadv > retail_gadv
(1,950 missing values generated)

. replace onfc_dummy = 0 if onfc_dummy ==.
(1,950 real changes made)

. 
. *Priority1
. gen npri_dummy = 1 if non_priority_gadv > priority_gadv
(262 missing values generated)

. replace npri_dummy = 0 if npri_dummy ==.
(262 real changes made)

. 
. gen mse_dummy = 1 if mse_gadv > other_priority_gadv
(945 missing values generated)

. replace mse_dummy = 0 if mse_dummy ==.
(945 real changes made)

. 
. gen opri_dummy = 1 if other_priority_gadv > mse_gadv
(1,614 missing values generated)

. replace opri_dummy = 0 if opri_dummy ==.
(1,614 real changes made)

. 
. *Infrastructure1
. gen trans_dummy = 1 if transport > energy & transport > water_sanitation & ///
> transport > communication & transport > soc_comm_infra
(2,373 missing values generated)

. replace trans_dummy = 0 if trans_dummy ==.
(2,373 real changes made)

. 
. gen energy_dummy = 1 if energy > transport & energy > water_sanitation & ///
> energy > communication & energy > soc_comm_infra
(2,069 missing values generated)

. replace energy_dummy = 0 if energy_dummy ==.
(2,069 real changes made)

. 
. gen water_dummy = 1 if water_sanitation > transport & water_sanitation > energy & ///
> water_sanitation > communication & water_sanitation > soc_comm_infra
(2,382 missing values generated)

. replace water_dummy = 0 if water_dummy ==.
(2,382 real changes made)

. 
. gen comm_dummy = 1 if communication > transport & communication > energy & ///
> communication > water_sanitation & communication > soc_comm_infra
(1,373 missing values generated)

. replace comm_dummy = 0 if comm_dummy ==.
(1,373 real changes made)

. 
. gen soc_comm_dummy = 1 if soc_comm_infra > transport & soc_comm_infra > energy & ///
> soc_comm_infra > water_sanitation & soc_comm_infra > communication
(2,355 missing values generated)

. replace soc_comm_dummy = 0 if soc_comm_dummy ==.
(2,355 real changes made)

. 
. *Sector2
. egen sum_sec_gadv = rowtotal(food_cred_gadv agri_gadv ind_gadv serv_gadv retail_gadv onfc_ga
> dv)

. replace sum_sec_gadv =. if sum_sec_gadv == 0
(216 real changes made, 216 to missing)

. 
. gen food_ratio = food_cred_gadv/sum_sec_gadv
(1,467 missing values generated)

. gen agri_ratio = agri_gadv/sum_sec_gadv
(1,282 missing values generated)

. gen ind_ratio = ind_gadv/sum_sec_gadv
(899 missing values generated)

. gen serv_ratio = serv_gadv/sum_sec_gadv
(464 missing values generated)

. gen retail_ratio = retail_gadv/sum_sec_gadv
(541 missing values generated)

. gen onfc_ratio = onfc_gadv/sum_sec_gadv
(1,656 missing values generated)

. 
. bysort quarter_2: egen food_ratio_med = median(food_ratio)

. bysort quarter_2: egen agri_ratio_med = median(agri_ratio)

. bysort quarter_2: egen ind_ratio_med = median(ind_ratio)

. bysort quarter_2: egen serv_ratio_med = median(serv_ratio)

. bysort quarter_2: egen retail_ratio_med = median(retail_ratio)

. bysort quarter_2: egen onfc_ratio_med = median(onfc_ratio)

. 
. gen fc_dummy2 = 1 if food_ratio >= food_ratio_med
(462 missing values generated)

. replace fc_dummy2 = 0 if food_ratio < food_ratio_med
(462 real changes made)

. // replace fc_dummy2 = 0 if food_ratio ==.
. replace fc_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. gen agri_dummy2 = 1 if agri_ratio >= agri_ratio_med
(552 missing values generated)

. replace agri_dummy2 = 0 if agri_ratio < agri_ratio_med
(552 real changes made)

. // replace agri_dummy2 = 0 if agri_ratio ==.
. replace agri_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. gen ind_dummy2 = 1 if ind_ratio >= ind_ratio_med
(745 missing values generated)

. replace ind_dummy2 = 0 if ind_ratio < ind_ratio_med
(745 real changes made)

. // replace ind_dummy2 = 0 if ind_ratio ==.
. replace ind_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. gen serv_dummy2 = 1 if serv_ratio >= serv_ratio_med
(880 missing values generated)

. replace serv_dummy2 = 0 if serv_ratio < serv_ratio_med
(880 real changes made)

. // replace serv_dummy2 = 0 if serv_ratio ==.
. replace serv_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. gen retail_dummy2 = 1 if retail_ratio >= retail_ratio_med
(897 missing values generated)

. replace retail_dummy2 = 0 if retail_ratio < retail_ratio_med
(897 real changes made)

. // replace retail_dummy2 = 0 if retail_ratio ==.
. replace retail_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. gen onfc_dummy2 = 1 if onfc_ratio >= onfc_ratio_med
(366 missing values generated)

. replace onfc_dummy2 = 0 if onfc_ratio < onfc_ratio_med
(366 real changes made)

. // replace onfc_dummy2 = 0 if onfc_ratio ==.
. replace onfc_dummy2 = . if food_ratio ==. & agri_ratio ==. & ind_ratio ==. & ///
> serv_ratio ==. & onfc_ratio ==.
(364 real changes made, 364 to missing)

. 
. 
. *Priority2
. egen sum_pri_gadv = rowtotal(non_priority_gadv mse_gadv other_priority_gadv)

. replace sum_pri_gadv =. if sum_pri_gadv == 0
(46 real changes made, 46 to missing)

. 
. gen npri_ratio = non_priority_gadv/sum_pri_gadv
(55 missing values generated)

. gen mse_ratio = mse_gadv/sum_pri_gadv
(286 missing values generated)

. gen opri_ratio = other_priority_gadv/sum_pri_gadv
(80 missing values generated)

. 
. bysort quarter_2: egen npri_ratio_med = median(npri_ratio)

. bysort quarter_2: egen mse_ratio_med = median(mse_ratio)

. bysort quarter_2: egen opri_ratio_med = median(opri_ratio)

. 
. gen npri_dummy2 = 1 if npri_ratio >= npri_ratio_med
(1,173 missing values generated)

. replace npri_dummy2 = 0 if npri_ratio < npri_ratio_med
(1,173 real changes made)

. replace npri_dummy2 = 0 if npri_ratio ==.
(55 real changes made)

. replace npri_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(46 real changes made, 46 to missing)

. 
. gen mse_dummy2 = 1 if mse_ratio >= mse_ratio_med
(1,056 missing values generated)

. replace mse_dummy2 = 0 if mse_ratio < mse_ratio_med
(1,056 real changes made)

. replace mse_dummy2 = 0 if mse_ratio ==.
(286 real changes made)

. replace mse_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(46 real changes made, 46 to missing)

. 
. gen opri_dummy2 = 1 if opri_ratio >= opri_ratio_med
(1,157 missing values generated)

. replace opri_dummy2 = 0 if opri_ratio < opri_ratio_med
(1,157 real changes made)

. replace opri_dummy2 = 0 if opri_ratio ==.
(80 real changes made)

. replace opri_dummy2 = . if npri_ratio ==. & mse_ratio ==. & opri_ratio ==.
(46 real changes made, 46 to missing)

. 
. *Infrastructure2
. egen sum_infra_gadv = rowtotal(transport energy water_sanitation communication soc_comm_infr
> a)

. replace sum_infra_gadv =. if sum_infra_gadv == 0
(827 real changes made, 827 to missing)

. 
. bysort quarter_2: gen trans_ratio = transport/sum_infra_gadv
(995 missing values generated)

. bysort quarter_2: gen energy_ratio = energy/sum_infra_gadv
(920 missing values generated)

. bysort quarter_2: gen water_san_ratio = water_sanitation/sum_infra_gadv
(1,060 missing values generated)

. bysort quarter_2: gen comm_ratio = communication/sum_infra_gadv
(1,766 missing values generated)

. bysort quarter_2: gen soc_comm_ratio = soc_comm_infra/sum_infra_gadv
(1,011 missing values generated)

. 
. egen trans_ratio_med = median(trans_ratio)

. egen energy_ratio_med = median(energy_ratio)

. egen water_san_ratio_med = median(water_san_ratio)

. egen comm_ratio_med = median(comm_ratio)

. egen soc_comm_ratio_med = median(soc_comm_ratio)

. 
. gen trans_dummy2 = 1 if trans_ratio >= trans_ratio_med
(711 missing values generated)

. replace trans_dummy2 = 0 if trans_ratio < trans_ratio_med
(711 real changes made)

. // replace trans_dummy2 = 0 if trans_ratio ==.
. replace trans_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_dummy ==.
(0 real changes made)

. 
. gen energy_dummy2 = 1 if energy_ratio >= energy_ratio_med
(749 missing values generated)

. replace energy_dummy2 = 0 if energy_ratio < energy_ratio_med
(749 real changes made)

. // replace energy_dummy2 = 0 if energy_ratio ==.
. replace energy_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_dummy ==.
(0 real changes made)

. 
. gen water_dummy2 = 1 if water_san_ratio >= water_san_ratio_med
(679 missing values generated)

. replace water_dummy2 = 0 if water_san_ratio < water_san_ratio_med
(679 real changes made)

. // replace water_dummy2 = 0 if water_san_ratio ==.
. replace water_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_dummy ==.
(0 real changes made)

. 
. gen comm_dummy2 = 1 if comm_ratio >= comm_ratio_med

. replace comm_dummy2 = 0 if comm_ratio < comm_ratio_med
(0 real changes made)

. // replace comm_dummy2 = 0 if comm_ratio ==.
. replace comm_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_dummy ==.
(0 real changes made)

. 
. gen soc_comm_dummy2 = 1 if soc_comm_ratio >= soc_comm_ratio_med
(703 missing values generated)

. replace soc_comm_dummy2 = 0 if soc_comm_ratio < soc_comm_ratio_med
(703 real changes made)

. // replace soc_comm_dummy2 = 0 if soc_comm_ratio ==.
. replace soc_comm_dummy2 = . if trans_ratio ==. & energy_ratio ==. & ///
> water_san_ratio ==. & comm_ratio ==. & soc_comm_dummy ==.
(0 real changes made)

. 
. *Sector3
. egen sec_tot = rowtotal(food_cred_gadv agri_gadv ind_gadv serv_gadv retail_gadv ///
> onfc_gadv)

. 
. gen food_ratio2 = food_cred_gadv/sec_tot
(1,467 missing values generated)

. gen agri_ratio2 = agri_gadv/sec_tot
(1,282 missing values generated)

. gen ind_ratio2 = ind_gadv/sec_tot
(899 missing values generated)

. gen serv_ratio2 = serv_gadv/sec_tot
(464 missing values generated)

. gen retail_ratio2 = retail_gadv/sec_tot
(541 missing values generated)

. gen onfc_ratio2 = onfc_gadv/sec_tot
(1,656 missing values generated)

. 
. gen fc_dummy3 = 1 if food_ratio2 > agri_ratio2 & food_ratio2 > ind_ratio2 & ///
> food_ratio2 > serv_ratio2 & food_ratio2 > retail_ratio2 & food_ratio2 > onfc_ratio2
(2,346 missing values generated)

. replace fc_dummy3 = 0 if fc_dummy3 ==.
(2,346 real changes made)

. replace fc_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==.
(1,482 real changes made, 1,482 to missing)

. 
. gen agri_dummy3 = 1 if agri_ratio2 > food_ratio2 & agri_ratio2 > ind_ratio2 & ///
> agri_ratio2 > serv_ratio2 & agri_ratio2 > retail_ratio2 & agri_ratio2 > onfc_ratio2
(2,412 missing values generated)

. replace agri_dummy3 = 0 if agri_dummy3 ==.
(2,412 real changes made)

. replace agri_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==.
(1,482 real changes made, 1,482 to missing)

. 
. gen ind_dummy3 = 1 if ind_ratio2 > food_ratio2 & ind_ratio2 > agri_ratio2 & ///
> ind_ratio2 > serv_ratio2 & ind_ratio2 > retail_ratio2 & ind_ratio2 > onfc_ratio2
(2,072 missing values generated)

. replace ind_dummy3 = 0 if ind_dummy3 ==.
(2,072 real changes made)

. replace ind_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==.
(1,482 real changes made, 1,482 to missing)

. 
. gen serv_dummy3 = 1 if serv_ratio2 > food_ratio2 & serv_ratio2 > agri_ratio2 & ///
> serv_ratio2 > ind_ratio2 & serv_ratio2 > retail_ratio2 & serv_ratio2 > onfc_ratio2
(2,248 missing values generated)

. replace serv_dummy3 = 0 if serv_dummy3 ==.
(2,248 real changes made)

. replace serv_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==.
(1,482 real changes made, 1,482 to missing)

. 
. gen retail_dummy3 = 1 if retail_ratio2 > food_ratio2 & retail_ratio2 > agri_ratio2 & ///
> retail_ratio2 > ind_ratio2 & retail_ratio2 > serv_ratio2 & retail_ratio2 > onfc_ratio2
(2,375 missing values generated)

. replace retail_dummy3 = 0 if retail_dummy3 ==.
(2,375 real changes made)

. replace retail_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==.
(1,482 real changes made, 1,482 to missing)

. 
. gen onfc_dummy3 = 1 if onfc_ratio2 > food_ratio2 & onfc_ratio2 > agri_ratio2 & ///
> onfc_ratio2 > ind_ratio2 & onfc_ratio2 > serv_ratio2 & onfc_ratio2 > retail_ratio2
(2,051 missing values generated)

. replace onfc_dummy3 = 0 if onfc_dummy3 ==.
(2,051 real changes made)

. replace onfc_dummy3 =. if food_cred_gadv ==. | agri_gadv ==. | ind_gadv ==. | ///
> serv_gadv ==. | retail_gadv ==. | onfc_gadv ==.
(1,847 real changes made, 1,847 to missing)

. 
. *food cred and agri all 0s
. 
. *Priority3
. egen pri_tot = rowtotal(non_priority_gnpa mse_gadv other_priority_gadv)

. 
. gen npri_ratio2 = non_priority_gnpa/pri_tot
(116 missing values generated)

. gen mse_ratio2 = mse_gadv/pri_tot
(327 missing values generated)

. gen opri_ratio2 = other_priority_gadv/pri_tot
(127 missing values generated)

. 
. gen npri_dummy3 = 1 if npri_ratio2 > mse_ratio2 & npri_ratio2 > opri_ratio2
(2,331 missing values generated)

. replace npri_dummy3 = 0 if npri_dummy3 ==.
(2,331 real changes made)

. replace npri_dummy3 =. if non_priority_gadv ==. | mse_gadv ==. | other_priority_gadv ==.
(265 real changes made, 265 to missing)

. 
. gen mse_dummy3 = 1 if mse_ratio2 > npri_ratio2 & mse_ratio2 > opri_ratio2
(1,013 missing values generated)

. replace mse_dummy3 = 0 if mse_dummy3 ==.
(1,013 real changes made)

. replace mse_dummy3 =. if non_priority_gadv ==. | mse_gadv ==. | other_priority_gadv ==.
(265 real changes made, 265 to missing)

. 
. gen opri_dummy3 = 1 if opri_ratio2 > npri_ratio2 & opri_ratio2 > mse_ratio2
(1,627 missing values generated)

. replace opri_dummy3 = 0 if opri_dummy3 ==.
(1,627 real changes made)

. replace opri_dummy3 =. if non_priority_gadv ==. | mse_gadv ==. | other_priority_gadv ==.
(265 real changes made, 265 to missing)

. 
. *Infrastructure3
. egen tot_infra = rowtotal(transport energy water_sanitation communication soc_comm_infra)

. 
. gen trans_ratio2 = transport/tot_infra
(995 missing values generated)

. gen energy_ratio2 = energy/tot_infra
(920 missing values generated)

. gen water_san_ratio2 = water_sanitation/tot_infra
(1,060 missing values generated)

. gen comm_ratio2 = communication/tot_infra
(1,766 missing values generated)

. gen soc_comm_ratio2 = soc_comm_infra/tot_infra
(1,011 missing values generated)

. 
. gen trans_dummy3 = 1 if trans_ratio2 > energy_ratio2 & trans_ratio2 > water_san_ratio2 & ///
> trans_ratio2 > comm_ratio2 & trans_ratio2 > soc_comm_ratio2
(2,374 missing values generated)

. replace trans_dummy3 = 0 if trans_dummy3 ==.
(2,374 real changes made)

. replace trans_dummy3 = . if transport ==. | energy ==. | water_sanitation ==. | ///
> communication ==. | soc_comm_infra ==.
(1,795 real changes made, 1,795 to missing)

. 
. gen energy_dummy3 = 1 if energy_ratio2 > trans_ratio2 & energy_ratio2 > water_san_ratio2 & /
> //
> energy_ratio2 > comm_ratio2 & energy_ratio2 > soc_comm_ratio2
(2,069 missing values generated)

. replace energy_dummy3 = 0 if energy_dummy3 ==.
(2,069 real changes made)

. replace energy_dummy3 = . if transport ==. | energy ==. | water_sanitation ==. | ///
> communication ==. | soc_comm_infra ==.
(1,795 real changes made, 1,795 to missing)

. 
. gen water_dummy3 = 1 if water_san_ratio2 > trans_ratio2 & water_san_ratio2 > energy_ratio2 &
>  ///
> water_san_ratio2 > comm_ratio2 & water_san_ratio2 > soc_comm_ratio2
(2,382 missing values generated)

. replace water_dummy3 = 0 if water_dummy3 ==.
(2,382 real changes made)

. replace water_dummy3 = . if transport ==. | energy ==. | water_sanitation ==. | ///
> communication ==. | soc_comm_infra ==.
(1,795 real changes made, 1,795 to missing)

. 
. gen comm_dummy3 = 1 if comm_ratio2 > trans_ratio2 & comm_ratio2 > energy_ratio2 & ///
> comm_ratio2 > water_san_ratio2 & comm_ratio2 > soc_comm_ratio2
(1,593 missing values generated)

. replace comm_dummy3 = 0 if comm_dummy3 ==.
(1,593 real changes made)

. replace comm_dummy3 = . if transport ==. | energy ==. | water_sanitation ==. | ///
> communication ==. | soc_comm_infra ==.
(1,795 real changes made, 1,795 to missing)

. 
. gen soc_comm_dummy3 = 1 if soc_comm_ratio2 > trans_ratio2 & soc_comm_ratio2 > energy_ratio2 
> & ///
> soc_comm_ratio2 > water_san_ratio2 & soc_comm_ratio2 > comm_ratio2
(2,356 missing values generated)

. replace soc_comm_dummy3 = 0 if soc_comm_dummy3 ==.
(2,356 real changes made)

. replace soc_comm_dummy3 = . if transport ==. | energy ==. | water_sanitation ==. | ///
> communication ==. | soc_comm_infra ==.
(1,795 real changes made, 1,795 to missing)

. 
. *Region
. merge m:1 banks using "Stata/Branches/state_dummies.dta"
(variable banks was str47, now str57 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           542
        from master                       527  (_merge==1)
        from using                         15  (_merge==2)

    Matched                             1,891  (_merge==3)
    -----------------------------------------

. drop if _merge == 2
(15 observations deleted)

. sort banks quarter_2

. 
. // gen pbt_ratio = PBT/total_assets * 100
. //
. // tssmooth shwinters pbt_ratio_2 = pbt_ratio
. //
. // gen pat_ratio = PAT/total_assets * 100
. //
. // tssmooth shwinters pat_ratio_2 = pat_ratio
. //
. // gen ebpt_ratio = EBPT/total_assets * 100
. //
. // tssmooth shwinters ebpt_ratio_2 = ebpt_ratio
. 
. save "Stata/Merged/bank_vars.dta", replace
file Stata/Merged/bank_vars.dta saved

. 
. // use "Stata/Merged/bank_vars.dta", clear
. // keep if quarter_2 == tq(2016q4)
. // count if type_bank == 1 
. // *38 foreign banks
. // count if type_bank == 2
. // *19 private banks
. // count if type_bank == 3
. // *21 public banks
. // count if type_bank == 4
. // *0 small finance
. 
. log close
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Merged/merge_all.log
  log type:  text
 closed on:  27 Aug 2025, 14:58:14
----------------------------------------------------------------------------------------------
