----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Money Stock/ms_graph.log
  log type:  text
 opened on:  27 Aug 2025, 13:57:38

. drop _all

. use "Stata/Money Stock/money_stock.dta", clear

. *money stock in billions
. gen cp_bil = currency_public/1000000000

. gen dd_bil = demand_deposits/1000000000

. gen td_bil = time_deposits/1000000000

. gen od_bil = other_deposits/1000000000

. gen total_deposits_bil = dd_bil + td_bil + od_bil

. *Plotting graph
. tsset Date_2

Time variable: Date_2, 01jun2012 to 20dec2019, but with gaps
        Delta: 1 day

. graph twoway (tsline cp_bil dd_bil), tline(08nov2016) ///
>         ytitle("Rs Billion") xtitle("Time") ///
>         legend(pos(6) col(2) lab(1 "Currency with Public") lab(2 "Demand Deposits")) ///
>         xlabel(19448 "April 2013" 20178 "April 2015" 20765 "Demonetization" ///
>         21274 "April 2018" 21883 "Dec 2019",nogrid) ylabel(,nogrid) ///
>         saving("Graphs/gph/money_graph", replace)
(file Graphs/gph/money_graph.gph not found)
file Graphs/gph/money_graph.gph saved

. graph export "Graphs/jpg/money_graph.jpg", replace
file /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Graphs/jpg/money_graph.jpg saved as
    JPG format

. 
. graph twoway (tsline td_bil total_deposits_bil), tline(11nov2016) ///
>         ytitle("Rs billion") xtitle("Time") title("Money Stock") ///
>         legend(lab(1 "Time Deposits") lab(2 "Total Deposits")) ///
>         saving("Graphs/gph/money_graph_2", replace)
(file Graphs/gph/money_graph_2.gph not found)
file Graphs/gph/money_graph_2.gph saved

. graph export "Graphs/jpg/money_graph_2.jpg", replace
file /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Graphs/jpg/money_graph_2.jpg saved as
    JPG format

. 
. log close
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Money Stock/ms_graph.log
  log type:  text
 closed on:  27 Aug 2025, 13:57:41
----------------------------------------------------------------------------------------------
