----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Capital Adequacy/capital_
> adequacy.log
  log type:  text
 opened on:  27 Aug 2025, 12:36:27

. drop _all

. use "Stata/Capital Adequacy/capital_adequacy.dta", clear

. 
. *categorical variable for type
. gen type_bank = 1 if foreign_dummy == 1
(1,384 missing values generated)

. replace type_bank = 2 if private_dummy == 1
(631 real changes made)

. replace type_bank = 3 if public_dummy == 1
(753 real changes made)

. replace type_bank = 4 if small_finance_dummy == 1
(0 real changes made)

. 
. gen tier_1_mil = tier_1/1000000
(1 missing value generated)

. gen tier_1_comm_mil = tier_1_comm/1000000
(341 missing values generated)

. gen tier_2_mil = tier_2/1000000
(1 missing value generated)

. gen total_cap_mil = total_cap/1000000
(1 missing value generated)

. 
. drop if quarter_2 < tq(2016q3)
(1,485 observations deleted)

. drop if quarter_2 > tq(2017q1)
(940 observations deleted)

. 
. bysort type_bank: tabstat tier_1_mil tier_1_comm_mil tier_2_mil total_cap_mil, ///
> by(quarter_2) stat(mean semean)

----------------------------------------------------------------------------------------------
-> type_bank = 1

Summary statistics: Mean, se(mean)
Group variable: quarter_2 

quarter_2 |  ti~1_mil  ti~m_mil  tier_2~l  total_~l
----------+----------------------------------------
   2016q3 |  28754.96  28710.65  1903.534   30658.5
          |  7506.055  7506.081  596.4841  7914.924
----------+----------------------------------------
   2016q4 |  28951.37  28936.23  2038.504  30989.87
          |   7465.09  7465.212   597.294  7859.447
----------+----------------------------------------
   2017q1 |  30012.31  30012.31  1883.655  31895.97
          |  7790.165  7790.165  577.0883  8172.637
----------+----------------------------------------
    Total |  29243.33  29223.71  1942.197  31185.53
          |  4347.864  4347.908  338.1726  4573.977
---------------------------------------------------

----------------------------------------------------------------------------------------------
-> type_bank = 2

Summary statistics: Mean, se(mean)
Group variable: quarter_2 

quarter_2 |  ti~1_mil  ti~m_mil  tier_2~l  total_~l
----------+----------------------------------------
   2016q3 |  152837.4  152218.2  29927.92  182765.3
          |  51985.23  51807.32  12696.47   63948.9
----------+----------------------------------------
   2016q4 |  157663.2    154345  30698.25  188361.4
          |  53122.72  52572.23  13053.02  65362.26
----------+----------------------------------------
   2017q1 |    173456  167765.1  28394.61  201850.6
          |  57313.89  55499.86  11789.52  68498.75
----------+----------------------------------------
    Total |  161318.9  158109.4  29673.59  190992.4
          |  30797.64  30294.57  7114.365  37478.87
---------------------------------------------------

----------------------------------------------------------------------------------------------
-> type_bank = 3

Summary statistics: Mean, se(mean)
Group variable: quarter_2 

quarter_2 |  ti~1_mil  ti~m_mil  tier_2~l  total_~l
----------+----------------------------------------
   2016q3 |  369734.3  346267.6    106972  476706.3
          |  220863.3  209451.8  63064.37  283900.5
----------+----------------------------------------
   2016q4 |  372141.4  343821.5  108932.4  481073.8
          |  223558.7  209381.9  64540.46  288081.8
----------+----------------------------------------
   2017q1 |  382570.1  352671.1  105923.7  488493.9
          |  234873.8    223076  62549.62  297397.3
----------+----------------------------------------
    Total |  374815.3  347586.7    107276  482091.3
          |  129133.9  122037.5  36138.38  165239.7
---------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/uddhav/Desktop/Undergrad Thesis/Banks-NPAs/Stata/Capital Adequacy/capital_
> adequacy.log
  log type:  text
 closed on:  27 Aug 2025, 12:36:27
----------------------------------------------------------------------------------------------
